//
//  WeChatOperation.swift
//  Memo
//
//  Created by HPCL20190110 on 2019/4/8.
//  Copyright © 2019 become into an evil. All rights reserved.
//

//import Foundation


/*
 
 需要注意的地方
 1.女人需要的是平等的交流,不是跪舔的,烦人的.我们只要适当地引导话题即可,切忌长篇大幅去回复女人.

 
 展示面收效一般,那么还有一个东西就是聊天.
 
 聊天中女人的窗口一般,我们就不能太过于热情.  (一开始跪舔就会GG)  跪舔是会产生压力的,压力会产生紧张和抗拒,会导致聊天过程不太顺利."控制需求感"

 最初级的手段 "控制需求感"
 

 开启话题
 
 场景: 情人节
 开场: "情人出现了"
 
 
 
 聊天话题
 "我感觉你还蛮成熟的"  -- 这句话是在勾起她的好奇心.
 
 
 聊天框架
 "勾起好奇 -- 回应好奇 -- 强调自己标准 -- 展现自己态度" 这一套聊天的流程
 接下来就是提升关系的时刻 技巧: "角色扮演"  "服从性测试"
 举例:  "F: 才不是你的,是我的"  "M: 他是我儿子"  "M: 好吧,不跟你争了,是我们的"
 
 
 不要急于道歉,这样就会低一个等级.
 
 
 三个例子判断女人是否暗恋你
 1 女生经常在你朋友圈下面评论或者点赞.
 2 看女人和你聊天字数多不多 她会主动开启话题
 3 回信息的速度是不是秒回
 
 
 套路约会
 第一步: 寒暄
 
 
 */




