//
//  WeChatOperation.swift
//  Memo
//
//  Created by HPCL20190110 on 2019/4/8.
//  Copyright © 2019 become into an evil. All rights reserved.
//

//import Foundation


// 这是不是刚开始认识呢

/*

 F: 我已经通过你的朋友验证请求,现在可以开始聊天了
 
 
 M: [可爱的动态表情]
 
 
 F: hello
 
 
 M: ✅ 干嘛呢 
    ❌ 你的眼睛好像梅花鹿 (什么?梅花鹿?这是夸我还是骂我呢?你才像梅花鹿!)
 
 
 F: 怎么?
 
 
 M: 问你呢
 
 
 F: 打牌呀
 
 
 M: ✅ 赢了输了
    ❌ 哦哦,挺好的 (话都说死了,这话我要怎么接?算了,不回了.)
    ❌ 还会打牌啊 (搞得之前很了解我一样,会打牌不是挺正常吗?没话找话?)
 
 
 F: 嘻嘻,赢啦,已经快打完了
 
 
 M: ✅ 看来一会要好好犒劳一下自己啦,肯定死了好多脑细胞
    ❌ 你这么厉害,美女求带飞 (这男的是马屁精啊?还带飞?我又不是要找个弟弟当男朋友!)
    ❌ 快打完了呀,那一会约一下?我请你吃饭 (这才聊了5句话,就要约我?我是这么随便就能约的人吗?)
 

 
 F: 竟然被你发现了,一会还要和闺蜜聚餐,今天手气太顺啦
 
 
 
 M: ❌毕竟我是神算子,哈哈 ()
    ❌ 要多吃点,路上注意安全 (这个怎么接?话题终结者!我只能回你两个字:好的)
    ✅ 嗯呢,我正去健身的路上哈,咱们空了再聊
 

 
 F: 好的呀,看来你生活挺健康的,加油~
 
 
 
 M: ❌ 情人节快乐 (群发的? 算了,不回)
    ❌ 美女,今天情人节,有什么安排! (美女?这个称号怎么听起来有点油腻的感觉?这是要约我干嘛吗?)
    ✅ 今天是情人节哦[坏笑]
 
 
 
 F: 没有情人的情人节
 
 
 (聊天告一段落,过了夜里十二点,然后继续聊天, 下面的这些聊天里没有话术分析)
 
 M: 我给你变出来!biu~情人出现了
 
 F: [偷笑][偷笑]情人你没带礼物出现
 
 M: 我就是
 
 F: 怎么没有包装 
 
 M: 包装不重要,重要的是礼物本身
 
 F: 嗯呐,那要谢谢你的礼物咯
 
 M: 话说何时来取?[坏笑]
 
 F: 哈哈哈,第一次有人用这种方式约我~ 今天太晚啦,改天一定取[可爱]
 
 M: 改天是明天后天还是大后天 
 
 F: 明天后天都比较忙, 不然大后天看看咯,应该有空 
 
 M: 我看看我的安排,不过也没事,我提前腾时间,那我们暂定大后天~
 
 F: OK
 
 
 (以下开始有聊天分析)
 
 
 M: ❌ [可爱的儿童动态表情]
    ❌ 哼, 你都不找我聊天  ()
    ❌ 别忘记后天的约会哦~ (开门尖山不太好,给女生的感觉是你目的性太强!)
 
 

 F: (这里没有消息,代码有 bug)
 
 
 M: ❌ 我才不舍得 ()
    ✅ 再调皮要拿鞭子了哦
    ❌ [我才懒得打你 动态表情] (话题容易跑偏)
 
 
 F: 你舍得
 
 
 M: ❌ 当然舍得咯 (f: 呵,男人!下半身思考的动物,看来没把我当回事!)
    ❌ 不舍得,因为你是我的宝贝呀 (只能算及格分的回复,太提前暴露需求感了)
    ✅ 不舍得~ 那换个抽,让你调皮咯
 

 F: 我错了
 
 
 
 M: ❌ [冷漠]的动态表情 (只能算及格分的回复,当女生示弱的时候不能再咄咄逼人)
    ❌ 呵呵 (聊天止于呵呵!当女生示弱的时候不能再咄咄逼人)
    ✅ 乖,摸摸头
 
 
 F: 
 
 
 (又过了一天.... )
 
 M: ✅ 我的女人呢
    ❌ [微笑]的表情
    ❌ [可爱的动态表情]
 
 
 F: 父亲,我的母亲呢

 
 M: ✅ 你照镜子就知道在哪了
    ❌ 正在跟我聊天呢 (只能算及格分的回复,回复比较平淡)
    ❌ 你的母亲还没找到呢 (只能算及格分的回复,容易把话题带偏)
 
 
 F: 猪八戒照镜子吗?
 
 
 M: ❌ 猪八戒比你好看  (话说得有点重,容易引起反感)
    ❌ 请不要这样夸猪八戒 , 哈哈哈 (只能算及格分的回复,容易把话题带偏)
    ✅ 对呀~明天就能看到猪八戒啦~开心
 
 
 F: [可爱]的表情 
 
 
 M: ❌ 明天你见我的时候要化妆吗 [含羞]  ()
    ❌ 明天见我的时候你一定要化妆哦 [含羞] ()
    ✅ 明天要打扮得漂漂亮亮的哦
 

 F: [可爱的表情] 好好好,你要求还真多 哈哈 
 
 
 
 M: ✅ 乖哦~要死明天控制不住不想你走了咋办~
    ❌ 乖哦~明天我们就去吃饭逛街看电影,go~ (只能算及格分的回复 ,妹子窗口不错,是深入做预期的好时机,不能这么简单就放弃了)
    ❌ 乖哦~明天我已经订好房间咯,准备好喊"父亲"[坏笑]  ()
 
 
 F: [白眼]的表情 那就多陪你一会
 
 
 M: ✅ 那就不让你回去了~我想抱着你睡
    ❌ 好啊,那就多陪我半个小时 (只能算及格分的回复 ,妹子窗口不错,是深入做预期的好时机,不能这么简单就放弃了)
    ❌ 开玩笑的啦,晚上太晚了,你回去不安全  (只能算及格分的回复,这样回复,可能你和妹子深入发展这段关系需要再延长很长时间,妹子窗口不错,是深入做预期的好时机,不能这么简单就放弃了)
 
 
 F:你这么随便,不觉得脏?明天我不去了 
 
 
 M: ✅ 那要看对什么人,不是谁都有感觉
    ❌ 我开玩笑了,别激动嘛  (只能算及格分的回复,有点怂,妹子出现 ASD 是好事,解决了这关就过了..........)
    ❌ 我错了,不该说那样的话,只怪我太喜欢你了  (太怂了,还道歉!  自己说出来的话作为男人要自己承担,更要去解决,还说太喜欢了极度暴露需求感)
 
 
 F: 我也是你没有见过面的人,你能有什么感觉!
 
 
 M: ❌ 行!我的错,行了吧 (及格分的回复,怂,......)
    ❌ 你这让我怎么说,感觉说不清道不明 (只能算及格分的回复,有点逃避问题,不够直面!)
    ✅ 气质 style 我喜欢,我又不是傻逼
 
 
 F: 哼,气质的很多好不,我还是不去了 
 

 
 M: ❌ 那就下次再约 (下次夜长梦多,这种情况下,这次没搞定,下一次更不太可能了)
    ✅ 好不容易相信个人,你竟然水了
    ❌ 别~宝宝我都安排好了,明天我们还是继续见嘛 (及格分,和前面的态度,情绪,反差和落差太大了,女生很容易觉得你只是一时打肿脸充胖子,撑不过几分钟)
 

 F: 行!我的错
 
 
 M: ❌ 我要亲亲才会好 (没看懂妹子现在说这句话的意思,对方只是不想继续跟你吵了,提要求为时尚早)
    ❌ 那明天我们还是不见不散 (没看懂妹子现在说这句话的意思,对方只是不想继续跟你吵了,提要求为时尚早)
    ✅ [流汗]的表情
 
 
 F: 你还真气啦 
 
 
 M: ❌ 没有  (妹子第二次主动妥协,不能在傲下去了,只会给妹子造成得寸进尺的感觉)
    ✅ 还好吧
    ❌ 对啊,很生气 (妹子第二次主动妥协,不能在傲下去了,只会给妹子造成得寸进尺的感觉)
 
 
 
 F: 我没想到你真当真
 
 
 
 M: ❌ 我只是一时生气,过了就好了 (及格分)
    ✅ 翻篇啦,不说这个了,明天我要惩罚你请我吃个冰淇淋
    ❌ 哼,就是当真了,谁让你明天要水我 (及格分)
 
 
 F: 好[眨眼]
 
 
 
 */


/*
 
 
 
 M: ✅
 ❌  ()
 ❌  ()
 
 */





